app/views/posts/_posts.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 61
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 65
---
                <hr />
                <h6><%= pluralize(@comments.size, 'Comment', 'Comments') %></h6>