app/views/posts/_post.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 62
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 62
---
    <hr />
    <h6><%= pluralize(@comments.size, 'Comment', 'Comments') %></h6>