app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "created_at", "post_id", "text", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "DDD"], ["created_at", Fri, 09 Aug 2013 21:28:10 UTC +00:00], ["post_id", nil], ["text", "DDD"], ["updated_at", Fri, 09 Aug 2013 21:28:10 UTC +00:00]]
---
  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save