app/controllers/posts_controller.rb

  def index
    @posts = Post.find(:all, :order => 'created_at DESC')
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 84 LIMIT 1

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("author", "created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Diego"], ["created_at", Thu, 25 Jul 2013 23:19:29 UTC +00:00], ["text", "Test"], ["title", "Test"], ["updated_at", Thu, 25 Jul 2013 23:19:29 UTC +00:00]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "posts" SET "text" = 'Olá Brasil 3.', "updated_at" = '2013-07-25 23:39:32.027182' WHERE "posts"."id" = 4